{
  "description": "This is all copy-pasted from The Good Place wiki",
  "ellenor": "During her time on earth Eleanor was rude, selfish and self-centered. She largely lived by the code \"I don't owe you anything and you don't owe me anything\".\n\nDue to being neglected by her self-centered parents for most of her life, Eleanor grew to believe that depending on others was a sign of weakness and thus prevented herself from ever being part of a group, even quitting a job simply because it required employees to hang out with each other after work. Eleanor stated that she has used her parents as the source for her horrible behavior her entire life. Eleanor is bisexual.\n\nEleanor is extremely insecure about her own ethical shortcomings, and as a result, lashes out at anyone who she perceives as more virtuous than her. She isn't ashamed to lie to others and go back on her promises, and rarely ever took responsibility for any of her actions. She even supported a coffee shop that had a manager who sexually harrassed female employees.\n\nHowever, after ending up in The Good Place by mistake, Eleanor attempts to learn more about ethics from Chidi Anagonye in order to avoid being sent to The Bad Place.\n\nWhile she initially did this solely for self-preservation, she begins to gradually become more selfless and thoughtful as time goes by, no longer needing to suppress her conscience and guilt.\n\nThough she rarely shows it, it is clear in a flashback that the lack of a loving and supporting family has deeply wounded her, and during her time in The Good Place she continues to better understand and accept her flaws in an attempt to become a truly good person. She does start to get better, but she does have her flaws. By the end of season 1, you can see that she has changed a lot, such as making the decision to go back for her friends when they were in danger of going to the bad place.",
  "chidi": "Chidi is a kind and extremely intelligent individual. He is passionate about moral philosophy and ethics, constantly quoting famous philosophers and putting many of the scenarios he and others get into under a philosophical microscope.\n\nChidi is easily prone to becoming anxious and nervous when under pressure, leading to him getting numerous stomach aches. He loves teaching.\n\nChidi has a huge flaw, however, that being his crippling indecisiveness. He is practically incapable of making quick, snap decisions, needing to deliberate over and over again even the smallest things.\n\nHis overwhelming knowledge of ethics often caused him to obsess over whether even his most insignificant actions were ethical, such as telling his friend he liked his boots when in fact he hated them, even going as far as to admit to his friend months later after his surgery that he was lying.\n\nThough he is well-meaning, Chidi's hesitance to make decisions ultimately led to him torturing those around him and would eventually cause his death.\n\nHis inability to take a definite stance is even shown in his work. His manuscript on ethics was so long, confusing, and inconsistent that it took Michael (who can read all of humanity's literature in just an hour) two weeks to finish it. Michael however, was likely exaggerating, for the sake of torturing Chidi.\n\nDespite this, with the help of Eleanor, Chidi begins to understand his issues and attempts to resolve them. ",
  "jason": "Jason Mendoza is a pre-successful DJ from Jacksonville, Florida who earned money by selling fake drugs to college students. He was best friends with a guy named Pillboi and often talked about his dream of making it big as a DJ.\n\nJason often tells bizarre and disturbing stories about his past nonchalantly, such as how he went to school in a junkyard that was really just a bunch of tugboats tied together on land.\n\nHe would eventually die during a botched robbery, suffocating after locking himself in a safe.\n\nThough he initially pretends to be the silent monk Jianyu Li, whom he was mistaken for, he eventually reveals himself to Eleanor and everyone else.\n\nJason is best characterized by his oblivious and childlike nature, with him rarely ever fully understanding the situation he's in, an example being how for a while he thought The Good Place was a prank show.\n\nLike Eleanor, Jason was generally not a good person when he was alive, mainly due to his ignorance and impulsiveness.\n\nJason is also capable of being quite selfish, immediately celebrating when Chidi and Tahani were set to go to The Bad Place in his and Eleanor's place, even going as far as to try and thwart Eleanor's plan to save them with a Molotov cocktail.\n\nDespite his flaws, Jason does have a good side, and it can be argued that most of his negative qualities are the result of his ignorance rather than malicious intent.\n\nDue to possibly never truly grasping the gravity of his situation, Jason is unwaveringly optimistic and upbeat, always keeping a positive attitude whether warranted or not.\n\nHe has also been shown to be kind to those such as Tahani, able to cheer her up and show empathy.",
  "tahani": "Tahani is Pakistani-English. She was born in Pakistan, raised in high society England, and consequently was very well educated. In both her life and afterlife she is regarded as highly intelligent, a brilliant conversationalist, and a wonderful hostess. She is exceptionally attractive and very fashionable. As she explains when initially introducing herself, the name Tahani means \"congratulations\" and Al-Jamil means \"beautiful\" - so her full name actually means \"Congratulations Beautiful!\"\n\nOne of her most impressive achievements was raising sixty billion dollars for a non-profit organization. She claims to have attended an English finishing school, the Hertfordshire School for Expressionless Girls, before studying at Oxford University and the Sorbonne in Paris, France.\n\nIn The Good Place, she is seen as an overly good person, which makes Eleanor Shellstrop insecure. She frequently name-drops celebrities, implying each one has a personal connection to her."
}
